from geopy.distance import geodesic

shop = ({
            'title': 'Hobby Games – Москва, у м. "Кузьминки"',
            'lonm': 55.70867853027259,
            'latm': 37.762927784253876,
            'address': 'г. Москва, Волгоградский проспект, д. 78'
        }, {
            'title': 'Hobby Games – Москва, в ТРК VEGAS на Каширском шоссе',
            'lonm': 55.6702995329406,
            'latm': 37.63937251133443,
            'address': 'Каширское ш., 25Бс8, Москва, Московская обл., 115582'
        }, {
            'title': 'Hobby Games – Одинцово, на Можайском шоссе',
            'lonm': 55.67994364701286,
            'latm': 37.29089801341258,
            'address': 'Московская область, г. Одинцово, Можайское шоссе, д. 71В'
        }, {
            'title': 'Hobby Games – Москва, у м. "Рассказовка"',
            'lonm': 55.63707354959125,
            'latm': 37.3292023594123,
            'address': 'г. Москва, поселение Внуковское, ул. Корнея Чуковского, д. 2'
        }, {
            'title': 'Hobby Games – Москва, у м. "Академическая"',
            'lonm': 55.688851362933995,
            'latm': 37.56965049807508,
            'address': 'г. Москва, ул. Дмитрия Ульянова, д. 16, корп. 1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Алексеевская"',
            'lonm': 55.809942823777924,
            'latm': 37.6396480441798,
            'address': 'г. Москва, ул. Староалексеевская, д. 8, офис № 1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Бауманская"',
            'lonm': 55.772316652902596,
            'latm': 37.68299217484077,
            'address': 'г. Москва, ул. Ладожская, д. 7а'
        }, {
            'title': 'Hobby Games – Москва, в "Афимолл Сити"',
            'lonm': 55.74927058606148,
            'latm': 37.53977899016899,
            'address': '	г. Москва, Пресненская набережная, д. 2, ТРЦ "Афимолл Сити"'
        }, {'title': 'Hobby Games – Москва, у м. "Китай-город"',
            'lonm': 55.754740197134986,
            'latm': 37.63563506688521,
            'address': 'г. Москва, Лубянский проезд, д. 27/1, стр. 1'
            }, {
            'title': 'Hobby Games – Москва, у м. "Курская"',
            'lonm': 55.76144352725319,
            'latm': 37.66231072880622,
            'address': 'г. Москва, Нижний Сусальный переулок, д. 5, стр. 2'
        },
        {
            'title': 'Hobby Games – Москва, у м. "Маяковская"',
            'lonm': 55.77243903249689,
            'latm': 37.59322339812841,
            'address': 'г. Москва, ул. 1-я Ямская-Тверская, д. 8'
        }, {
            'title': 'Hobby Games – Москва, у м. "Новослободская"',
            'lonm': 55.77717152525151,
            'latm': 37.60312200552955,
            'address': 'г. Москва, ул. Долгоруковская, д. 32 стр. 1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Римская"',
            'lonm': 55.74730167624489,
            'latm': 37.679346682769896,
            'address': 'г. Москва, ул. Сергия Радонежского, д. 29-31, стр. 1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Полянка"',
            'lonm': 55.73735570390992,
            'latm': 37.618723428791164,
            'address': 'г. Москва, ул. Большая Полянка, д. 26 стр. 2'
        }, {
            'title': 'Hobby Games – Москва, у м. "Сокол"',
            'lonm': 55.80653325266565,
            'latm': 37.51304588280786,
            'address': 'г. Москва, Ленинградский проспект, д. 78, корп.1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Спортивная"',
            'lonm': 55.72404125967623,
            'latm': 37.565367990152865,
            'address': 'г. Москва, ул. Усачёва, д. 29, корп. 3'
        },
        {
            'title': 'Hobby Games – Москва, у м. "Улица 1905 года"',
            'lonm': 55.763172444519604,
            'latm': 37.56581504415034,
            'address': 'г. Москва, ул. Красная Пресня, д. 38'
        }, {
            'title': 'Hobby Games – Москва, у м. "Сходненская"',
            'lonm': 55.85202290938345,
            'latm': 37.43793991749457,
            'address': 'г. Москва, ул. Героев Панфиловцев, д. 1А, ТЦ "Оранжевый мир", 2-й этаж'
        }, {
            'title': 'Hobby Games – Москва, у м. "Ховрино"',
            'lonm': 55.873507599500726,
            'latm': 37.48413095956329,
            'address': 'г. Москва, ул. Дыбенко, д. 7/1'
        }, {
            'title': 'Hobby Games – Москва, в ТЦ "Вэйпарк"',
            'lonm': 55.86544753749514,
            'latm': 37.39616177112881,
            'address': 'г. Москва, 71-й км МКАД, ТЦ "Вэйпарк"'
        }, {
            'title': 'Hobby Games – Москва, в ТРЦ "Рио"',
            'lonm': 55.91872520251918,
            'latm': 37.5386613532503,
            'address': 'г. Москва, Дмитровское шоссе, 163а, корп. 1, ТРЦ "Рио", 2-й этаж, рядом с фудкортом'
        },
        {
            'title': 'Hobby Games – Москва, у м. "Каширская"',
            'lonm': 55.656788927764055,
            'latm': 37.64773959805439,
            'address': 'г. Москва, Каширское шоссе, д. 25Б, стр. 8'
        },
        {
            'title': 'Hobby Games – Видное, в ТРЦ "Галерея 9-18"',
            'lonm': 55.54624690633928,
            'latm': 37.6989718633267,
            'address': 'г. Видное, ул. Олимпийская, д. 6, корп. 1, ТРЦ "Галерея 9-18"'
        },
        {
            'title': 'Hobby Games – Долгопрудный, в ТЦ "Город"',
            'lonm': 55.93665142776827,
            'latm': 37.49311095960365,
            'address': 'г. Долгопрудный, Лихачевский пр-т, д. 74, ТЦ "Город"'
        },
        {
            'title': 'Hobby Games – Железнодорожный, в ТЦ "Конфитюр"',
            'lonm': 55.743571475020566,
            'latm': 38.00148945948046,
            'address': 'г. Балашиха, мкр. Железнодорожный, ул. Рождественская, д. 3, ТЦ "Конфитюр", 2-й этаж'
        },
        {
            'title': 'Hobby Games – Зеленоград, в ТЦ "Панфиловский"',
            'lonm': 56.00899124189648,
            'latm': 37.19989256759467,
            'address': 'г. Зеленоград, Панфиловский проспект, д. 6А, ТЦ "Панфиловский", 2-й этаж'
        },
        {
            'title': 'Hobby Games – Зеленоград, в ТЦ "Столица"',
            'lonm': 55.98639820512531,
            'latm': 37.15090533875002,
            'address': 'г. Зеленоград, К2309А, ТЦ "Столица"'
        }, {
            'title': 'Hobby Games – Королёв, в ТЦ "Гелиос"',
            'lonm': 55.91499975928729,
            'latm': 37.86676295958959,
            'address': 'г. Королёв, пр-т Космонавтов, д. 20а, ТЦ "Гелиос", павильон 219'
        }, {
            'title': 'Hobby Games – Мытищи, на Новомытищинском проспекте',
            'lonm': 55.90357692428423,
            'latm': 37.72489727492498,
            'address': 'г. Мытищи, Новомытищинский пр-т, д. 39'
        }, {
            'title': 'Hobby Games – Пушкино, в ТЦ 999!',
            'lonm': 56.00990048060694,
            'latm': 37.849696478965654,
            'address': 'г. Пушкино, Московский проспект, д. 20, ТЦ 999!, 1-й этаж'
        },
)




