from geopy.distance import geodesic

shop = ({
            'title': 'Hobby Games – Москва, у м. "Кузьминки"',
            'lonm': 55.70867853027259,
            'latm': 37.762927784253876,
            'address': 'г. Москва, Волгоградский проспект, д. 78'
        }, {
            'title': 'Hobby Games – Москва, в ТРК VEGAS на Каширском шоссе',
            'lonm': 55.6702995329406,
            'latm': 37.63937251133443,
            'address': 'Каширское ш., 25Бс8, Москва, Московская обл., 115582'
        }, {
            'title': 'Hobby Games – Одинцово, на Можайском шоссе',
            'lonm': 55.67994364701286,
            'latm': 37.29089801341258,
            'address': 'Московская область, г. Одинцово, Можайское шоссе, д. 71В'
        }, {
            'title': 'Hobby Games – Москва, у м. "Рассказовка"',
            'lonm': 55.63707354959125,
            'latm': 37.3292023594123,
            'address': 'г. Москва, поселение Внуковское, ул. Корнея Чуковского, д. 2'
        }, {
            'title': 'Hobby Games – Москва, у м. "Академическая"',
            'lonm': 55.688851362933995,
            'latm': 37.56965049807508,
            'address': 'г. Москва, ул. Дмитрия Ульянова, д. 16, корп. 1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Алексеевская"',
            'lonm': 55.809942823777924,
            'latm': 37.6396480441798,
            'address': 'г. Москва, ул. Староалексеевская, д. 8, офис № 1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Бауманская"',
            'lonm': 55.772316652902596,
            'latm': 37.68299217484077,
            'address': 'г. Москва, ул. Ладожская, д. 7а'
        }, {
            'title': 'Hobby Games – Москва, в "Афимолл Сити"',
            'lonm': 55.74927058606148,
            'latm': 37.53977899016899,
            'address': '	г. Москва, Пресненская набережная, д. 2, ТРЦ "Афимолл Сити"'
        }, {'title': 'Hobby Games – Москва, у м. "Китай-город"',
            'lonm': 55.754740197134986,
            'latm': 37.63563506688521,
            'address': 'г. Москва, Лубянский проезд, д. 27/1, стр. 1'
            }, {
            'title': 'Hobby Games – Москва, у м. "Курская"',
            'lonm': 55.76144352725319,
            'latm': 37.66231072880622,
            'address': 'г. Москва, Нижний Сусальный переулок, д. 5, стр. 2'
        },
        {
            'title': 'Hobby Games – Москва, у м. "Маяковская"',
            'lonm': 55.77243903249689,
            'latm': 37.59322339812841,
            'address': 'г. Москва, ул. 1-я Ямская-Тверская, д. 8'
        }, {
            'title': 'Hobby Games – Москва, у м. "Новослободская"',
            'lonm': 55.77717152525151,
            'latm': 37.60312200552955,
            'address': 'г. Москва, ул. Долгоруковская, д. 32 стр. 1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Римская"',
            'lonm': 55.74730167624489,
            'latm': 37.679346682769896,
            'address': 'г. Москва, ул. Сергия Радонежского, д. 29-31, стр. 1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Полянка"',
            'lonm': 55.73735570390992,
            'latm': 37.618723428791164,
            'address': 'г. Москва, ул. Большая Полянка, д. 26 стр. 2'
        }, {
            'title': 'Hobby Games – Москва, у м. "Сокол"',
            'lonm': 55.80653325266565,
            'latm': 37.51304588280786,
            'address': 'г. Москва, Ленинградский проспект, д. 78, корп.1'
        }, {
            'title': 'Hobby Games – Москва, у м. "Спортивная"',
            'lonm': 55.72404125967623,
            'latm': 37.565367990152865,
            'address': 'г. Москва, ул. Усачёва, д. 29, корп. 3'
        },
        {
            'title': 'Hobby Games – Москва, у м. "Улица 1905 года"',
            'lonm': 55.763172444519604,
            'latm': 37.56581504415034,
            'address': 'г. Москва, ул. Красная Пресня, д. 38'
        }, {
            'title': 'Hobby Games – Москва, у м. "Сходненская"',
            'lonm': 55.85202290938345,
            'latm': 37.43793991749457,
            'address': 'г. Москва, ул. Героев Панфиловцев, д. 1А, ТЦ "Оранжевый мир", 2-й этаж'
        }, {
            'title': 'Hobby Games – Москва, у м. "Ховрино"',
            'lonm': 55.873507599500726,
            'latm': 37.48413095956329,
            'address': 'г. Москва, ул. Дыбенко, д. 7/1'
        }, {
            'title': 'Hobby Games – Москва, в ТЦ "Вэйпарк"',
            'lonm': 55.86544753749514,
            'latm': 37.39616177112881,
            'address': 'г. Москва, 71-й км МКАД, ТЦ "Вэйпарк"'
        }, {
            'title': 'Hobby Games – Москва, в ТРЦ "Рио"',
            'lonm': 55.91872520251918,
            'latm': 37.5386613532503,
            'address': 'г. Москва, Дмитровское шоссе, 163а, корп. 1, ТРЦ "Рио", 2-й этаж, рядом с фудкортом'
        },
        {
            'title': 'Hobby Games – Москва, у м. "Каширская"',
            'lonm': 55.656788927764055,
            'latm': 37.64773959805439,
            'address': 'г. Москва, Каширское шоссе, д. 25Б, стр. 8'
        },
        {
            'title': 'Hobby Games – Видное, в ТРЦ "Галерея 9-18"',
            'lonm': 55.54624690633928,
            'latm': 37.6989718633267,
            'address': 'г. Видное, ул. Олимпийская, д. 6, корп. 1, ТРЦ "Галерея 9-18"'
        },
        {
            'title': 'Hobby Games – Долгопрудный, в ТЦ "Город"',
            'lonm': 55.93665142776827,
            'latm': 37.49311095960365,
            'address': 'г. Долгопрудный, Лихачевский пр-т, д. 74, ТЦ "Город"'
        },
        {
            'title': 'Hobby Games – Железнодорожный, в ТЦ "Конфитюр"',
            'lonm': 55.743571475020566,
            'latm': 38.00148945948046,
            'address': 'г. Балашиха, мкр. Железнодорожный, ул. Рождественская, д. 3, ТЦ "Конфитюр", 2-й этаж'
        },
        {
            'title': 'Hobby Games – Зеленоград, в ТЦ "Панфиловский"',
            'lonm': 56.00899124189648,
            'latm': 37.19989256759467,
            'address': 'г. Зеленоград, Панфиловский проспект, д. 6А, ТЦ "Панфиловский", 2-й этаж'
        },
        {
            'title': 'Hobby Games – Зеленоград, в ТЦ "Столица"',
            'lonm': 55.98639820512531,
            'latm': 37.15090533875002,
            'address': 'г. Зеленоград, К2309А, ТЦ "Столица"'
        }, {
            'title': 'Hobby Games – Королёв, в ТЦ "Гелиос"',
            'lonm': 55.91499975928729,
            'latm': 37.86676295958959,
            'address': 'г. Королёв, пр-т Космонавтов, д. 20а, ТЦ "Гелиос", павильон 219'
        }, {
            'title': 'Hobby Games – Мытищи, на Новомытищинском проспекте',
            'lonm': 55.90357692428423,
            'latm': 37.72489727492498,
            'address': 'г. Мытищи, Новомытищинский пр-т, д. 39'
        }, {
            'title': 'Hobby Games – Пушкино, в ТЦ 999!',
            'lonm': 56.00990048060694,
            'latm': 37.849696478965654,
            'address': 'г. Пушкино, Московский проспект, д. 20, ТЦ 999!, 1-й этаж'
        },
        {
            'title': 'Мосигра – Москва, в ТРЦ "Ривьера"',
            'lonm': 55.705144858629005,
            'latm': 37.63902761352824,
            'address': 'Москва, улица Автозаводская, дом 18'
        },
        {
            'title': 'Мосигра – Москва, в ТРЦ "Браво"',
            'lonm': 55.63922531467313,
            'latm': 37.75933743610264,
            'address': 'Москва, улица Борисовские пруды, владение 26, корпус 2'
        }, {
            'title': 'Мосигра – Москва, у метро "Аэропорт"',
            'lonm': 55.80009564479536,
            'latm':  37.5352512981647,
            'address': 'Москва, проспект Ленинградский, дом 60, корпус 1'
        }, {
            'title': 'Мосигра – Москва, в ТРК "Москворечье"',
            'lonm': 55.65413463006283,
            'latm': 37.64684722870211,
            'address': 'Москва, Каширское шоссе, дом 26'
        },
        {
            'title': 'Мосигра – Москва, в МТК "ЕвроПарк"',
            'lonm': 55.76706012193351,
            'latm': 37.3807791981303,
            'address': 'Москва, Рублевское шоссе, дом 62'
        }, {
            'title': 'Мосигра – Москва, в ТРК "Атриум"',
            'lonm': 55.757737684361935,
            'latm': 37.65935143622658,
            'address': 'Москва, улица Земляной Вал, дом 33'
        }, {
            'title': 'Мосигра – Москва, в ТРЦ "Филион"',
            'lonm': 55.7444786268407,
            'latm': 37.50849567483199,
            'address': 'Москва, Багратионовский проезд, дом 5'
        }, {
            'title': 'Мосигра – Москва, в ТРЦ "Щёлковский"',
            'lonm': 55.811428171098385,
            'latm': 37.799599028866695,
            'address': 'Москва, Щелковское шоссе, дом 75'
        }, {
            'title': 'Мосигра – Москва, в ТРЦ "Океания"',
            'lonm': 55.72835749953623,
            'latm': 37.47630003670841,
            'address': 'Москва, Кутузовский проспект, дом 57'
        }, {
            'title': 'Мосигра – Москва, в ТРК "Щука"',
            'lonm': 55.810160699198114,
            'latm': 37.464901520936394,
            'address': 'Москва, улица Щукинская, дом 42'
        }, {
            'title': 'Мосигра – Москва, у метро "Таганская"',
            'lonm': 55.739059067045986,
            'latm': 37.650959998100724,
            'address': 'Москва, улица Народная, дом 8'
        }, {
            'title': 'Мосигра – Москва, в ТЦ "Саларис"',
            'lonm': 55.626030748816035,
            'latm': 37.39486919715743,
            'address': 'Москва, 23-й км, Киевское шоссе, дом 1'
        }, {
            'title': 'Мосигра – Москва, в ТЦ "Фестиваль"',
            'lonm': 55.69803013791072,
            'latm': 37.49486618498939,
            'address': 'Москва, Мичуринский проспект, дом 3, корпус 1'
        }, {
            'title': 'Мосигра – Москва, в ТРК "Европолис"',
            'lonm': 55.824797513944354,
            'latm': 37.64916979848561,
            'address': 'Москва, Проспект Мира, дом 211'
        }, {
            'title': 'Мосигра – Москва, в ТЦ "Принц Плаза"',
            'lonm': 55.68697074855655,
            'latm': 37.57315361197113,
            'address': 'Москва, улица Профсоюзная, дом 129А'
        }, {
            'title': 'Мосигра – Москва, у метро "Новослободская"',
            'lonm': 55.78165248102689,
            'latm': 37.601133913828996,
            'address': 'Москва, Сущевская улица, дом 13/15'
        }, {
            'title': 'Мосигра – Москва, в ТЦ "Улей"',
            'lonm': 55.8631005952499,
            'latm': 37.58519374081451,
            'address': 'Москва, Алтуфьевское шоссе, дом 24, корпус 1'
        }, {
            'title': 'Мосигра – Москва, в ТРЦ "Авиапарк"',
            'lonm': 55.78595213426423,
            'latm': 37.531469698484024,
            'address': 'Москва, Ходынский бульвар, дом 4'
        }, {
            'title': 'Мосигра – Москва, в ТЦ "Хорошо"',
            'lonm': 55.77672373585698,
            'latm': 37.52406088499256,
            'address': 'Москва, Хорошёвское шоссе, дом 27'
        },
        {
            'title': 'Мосигра – Москва, в ТЦ "БУМ"',
            'lonm': 55.65976183363216,
            'latm': 37.749747156151514,
            'address': 'Москва,  ул. Перерва, д. 43, корп. 1'
        }, {
            'title': 'Мосигра – Москва, в ТЦ "Бутово Молл"',
            'lonm': 55.52415665591516,
            'latm': 37.5180057138187,
            'address': 'Москва, поселение Воскресенское, Чечёрский проезд, 51'
        }, {
            'title': 'Мосигра – Котельники, в ТЦ "МЕГА Белая Дача"',
            'lonm': 55.660543578628904,
            'latm': 37.84831315615159,
            'address': 'Котельники, 1-й Покровский проезд, дом 5'
        }, {
            'title': 'Мосигра – Люберцы, в ТРЦ "Люберецкие Торговые Ряды"',
            'lonm': 55.68618689115782,
            'latm': 37.898734984988835,
            'address': 'Люберцы, улица Инициативная, дом 7Б'
        }, {
            'title': 'Мосигра – Московский, в ТРЦ "Новомосковский"',
            'lonm': 55.5942621401671,
            'latm': 37.35280967149402,
            'address': 'Москва, Московский, улица Хабарова, дом 2'
        },
)
